<h1> Panda Tutotial-Dhanu </h1>

In [2]:
import pandas

In [3]:
pandas.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.6.1.final.0
python-bits: 64
OS: Darwin
OS-release: 17.5.0
machine: x86_64
processor: i386
byteorder: little
LC_ALL: None
LANG: en_US.UTF-8
LOCALE: en_US.UTF-8

pandas: 0.20.1
pytest: 3.0.7
pip: 10.0.1
setuptools: 27.2.0
Cython: 0.25.2
numpy: 1.12.1
scipy: 0.19.0
xarray: None
IPython: 5.3.0
sphinx: 1.5.6
patsy: 0.4.1
dateutil: 2.6.0
pytz: 2017.2
blosc: None
bottleneck: 1.2.1
tables: 3.3.0
numexpr: 2.6.2
feather: None
matplotlib: 2.0.2
openpyxl: 2.4.7
xlrd: 1.0.0
xlwt: 1.2.0
xlsxwriter: 0.9.6
lxml: 3.7.3
bs4: 4.6.0
html5lib: 0.999
sqlalchemy: 1.1.9
pymysql: None
psycopg2: None
jinja2: 2.9.6
s3fs: None
pandas_gbq: None
pandas_datareader: 0.5.0

In [4]:
pandas.__version__

'0.20.1'

In [10]:
import pandas as pd
pd.__version__

'0.20.1'

<h3>pd.press tab will show all the functions available ,and to see the doc string pd.(function name)? for example pd.show_versions?
pd.sho+tab will auto fill the function names</h3>

In [17]:
pd.Series?

<h2>A dataframe is a two dimensional array,Jupyter notebook displays first and last 30 rows of a dataframe</h2>

In [18]:
df=pd.read_csv("olympics.csv" ,skiprows=4)#Observations start from row 5 in the original csv file
df.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [13]:
df['City'].head()

0    Athens
1    Athens
2    Athens
3    Athens
4    Athens
Name: City, dtype: object

In [14]:
df["City"].head()

0    Athens
1    Athens
2    Athens
3    Athens
4    Athens
Name: City, dtype: object

In [15]:
df.City.head()#Dot notation dosent work if theres a space between column name like "City Name"

0    Athens
1    Athens
2    Athens
3    Athens
4    Athens
Name: City, dtype: object

In [16]:
#More columns -list of column names 
df[["City","Edition","Sport"]].head()

     City  Edition     Sport
0  Athens     1896  Aquatics
1  Athens     1896  Aquatics
2  Athens     1896  Aquatics
3  Athens     1896  Aquatics
4  Athens     1896  Aquatics

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
type(df.City)#Type of single column will be a series

pandas.core.series.Series

In [19]:
type(df[["City","Edition","Sport"]])#Type of multiple columns will be a data frame

pandas.core.frame.DataFrame

In [20]:
df['NOC'].head()

0    HUN
1    AUT
2    GRE
3    GRE
4    GRE
Name: NOC, dtype: object

In [21]:
type(df['NOC'].head())

pandas.core.series.Series

In [24]:
df[["Edition","City","Athlete","Medal"]].head()

   Edition    City             Athlete   Medal
0     1896  Athens       HAJOS, Alfred    Gold
1     1896  Athens    HERSCHMANN, Otto  Silver
2     1896  Athens   DRIVAS, Dimitrios  Bronze
3     1896  Athens  MALOKINIS, Ioannis    Gold
4     1896  Athens  CHASAPIS, Spiridon  Silver

<h3>input files:pd.read_csv(),pd.read_excel(),pd.read_json(),pd.read_sql_table()</h3>

pd.read_csv(shift+tab)will show the method and press tab 4 times will display the entire docstring

In [28]:
df.shape #Gives the dimensions of the data frame as tuple

(29216, 10)

In [34]:
df.shape[0]

29216

In [33]:
df.shape[1]

10

<h3>df.info()</h3> provides a summary of the data frame including the number of entries, the data type, and the number of non-null entries for each series in the data frame.

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29216 entries, 0 to 29215
Data columns (total 10 columns):
City            29216 non-null object
Edition         29216 non-null int64
Sport           29216 non-null object
Discipline      29216 non-null object
Athlete         29216 non-null object
NOC             29216 non-null object
Gender          29216 non-null object
Event           29216 non-null object
Event_gender    29216 non-null object
Medal           29216 non-null object
dtypes: int64(1), object(9)
memory usage: 2.2+ MB

<h3>value_counts()</h3> It returns a series object, counting all the unique values. There are two things in particular to be aware of value_counts. As this is returning a count of the unique values, the first value is the most frequently occurring element. The second, the second most frequently occurring element and so on. This order can be reversed by just setting the ascending flag to True.
Dropna, one of the parameters within the value_counts is True by default and you will not get a count of the na values. The na values are the missing data values. If your data set has a significant number of na values, this can be misleading and you can turn this feature off by setting dropna to False.

In [47]:
df["City"].value_counts()

Athens                   2149
Los Angeles              2074
Beijing                  2042
Sydney                   2015
Atlanta                  1859
Barcelona                1705
London                   1618
Seoul                    1546
Paris                    1396
Moscow                   1387
Montreal                 1305
Antwerp                  1298
Munich                   1185
Mexico                   1031
Tokyo                    1010
Helsinki                  889
Melbourne / Stockholm     885
Stockholm                 885
Rome                      882
Berlin                    875
Amsterdam                 710
St Louis                  470
Name: City, dtype: int64

In [48]:
df.Edition.value_counts()

2008    2042
2000    2015
2004    1998
1996    1859
1992    1705
1988    1546
1984    1459
1980    1387
1976    1305
1920    1298
1972    1185
1968    1031
1964    1010
1952     889
1912     885
1956     885
1924     884
1960     882
1936     875
1948     814
1908     804
1928     710
1932     615
1900     512
1904     470
1896     151
Name: Edition, dtype: int64

In [50]:
df.Gender.value_counts()

Men      21721
Women     7495
Name: Gender, dtype: int64

<h3>Sort_values()</h3> sorts the values in a series. As axis is equal to zero, you are sorting along the column and in ascending order by default. So if you visualize a series as being a single column, you are sorting the contents of that column in ascending order. By default, the NaNs, or missing data, are put right at the end. Sort_values(), when used in conjunction with a DataFrame, is particularly useful as you can sort multiple series in ascending and descending order.

In [19]:
ath=df.Athlete.sort_values()
ath.head()

651                 AABYE, Edgar
2849       AALTONEN, Arvo Ossian
2852       AALTONEN, Arvo Ossian
7716    AALTONEN, Paavo Johannes
7730    AALTONEN, Paavo Johannes
Name: Athlete, dtype: object

In [20]:
df.sort_values(by=["Edition","Athlete"]).head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
7,Athens,1896,Aquatics,Swimming,"ANDREOU, Joannis",GRE,Men,1200m freestyle,M,Silver
82,Athens,1896,Gymnastics,Artistic G.,"ANDRIAKOPOULOS, Nicolaos",GRE,Men,rope climbing,M,Gold
110,Athens,1896,Gymnastics,Artistic G.,"ANDRIAKOPOULOS, Nicolaos",GRE,Men,"team, parallel bars",M,Silver
111,Athens,1896,Gymnastics,Artistic G.,"ATHANASOPOULOS, Spyros",GRE,Men,"team, parallel bars",M,Silver
48,Athens,1896,Cycling,Cycling Road,"BATTEL, Edward",GBR,Men,individual road race,M,Bronze

<h3>Boolean indexing.</h3> Boolean vectors or conditions can be used to filter data. Based on a condition, pass series of true and false values to a series or data frame to select and display the rules where the series has true values. Instead of using and, or, or not, as with most programming languages, you can use the following symbols instead. Remember that if you have more than one condition, or Boolean vector, this must be grouped in brackets or parentheses.

This is to ensure that the order of operations is carried out correctly.(AND = & , OR = | , NOT =~)

In [73]:
df.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
7,Athens,1896,Aquatics,Swimming,"ANDREOU, Joannis",GRE,Men,1200m freestyle,M,Silver
82,Athens,1896,Gymnastics,Artistic G.,"ANDRIAKOPOULOS, Nicolaos",GRE,Men,rope climbing,M,Gold
110,Athens,1896,Gymnastics,Artistic G.,"ANDRIAKOPOULOS, Nicolaos",GRE,Men,"team, parallel bars",M,Silver
111,Athens,1896,Gymnastics,Artistic G.,"ATHANASOPOULOS, Spyros",GRE,Men,"team, parallel bars",M,Silver
48,Athens,1896,Cycling,Cycling Road,"BATTEL, Edward",GBR,Men,individual road race,M,Bronze

In [26]:
df.Medal=="Gold"

0         True
1        False
2        False
3         True
4        False
5        False
6         True
7        False
8        False
9         True
10       False
11       False
12       False
13        True
14       False
15        True
16       False
17       False
18        True
19       False
20       False
21        True
22       False
23       False
24        True
25       False
26       False
27        True
28       False
29        True
         ...
29186    False
29187     True
29188    False
29189    False
29190    False
29191     True
29192    False
29193    False
29194    False
29195     True
29196    False
29197    False
29198    False
29199     True
29200    False
29201    False
29202    False
29203     True
29204    False
29205    False
29206     True
29207    False
29208    False
29209    False
29210     True
29211    False
29212    False
29213    False
29214     True
29215    False
Name: Medal, Length: 29216, dtype: bool

In [21]:
df[df.Medal=="Gold"].head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
6,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,1200m freestyle,M,Gold
9,Athens,1896,Aquatics,Swimming,"NEUMANN, Paul",AUT,Men,400m freestyle,M,Gold
13,Athens,1896,Athletics,Athletics,"BURKE, Thomas",USA,Men,100m,M,Gold

In [22]:
df[df.Medal=="Gold"].Athlete.sort_values().head()

651                  AABYE, Edgar
7716     AALTONEN, Paavo Johannes
7730     AALTONEN, Paavo Johannes
7773     AALTONEN, Paavo Johannes
28460            AAMODT, Ragnhild
Name: Athlete, dtype: object

In [23]:
df[(df.Medal=="Gold") & (df.Gender=='Women')].head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
417,Paris,1900,Golf,Golf,"ABBOTT, Margaret Ives",USA,Women,individual,W,Gold
641,Paris,1900,Tennis,Tennis,"COOPER, Charlotte",GBR,Women,mixed doubles,X,Gold
649,Paris,1900,Tennis,Tennis,"COOPER, Charlotte",GBR,Women,singles,W,Gold
710,St Louis,1904,Archery,Archery,"HOWELL, Matilda Scott",USA,Women,double columbia round (50y - 40y - 30y),W,Gold
713,St Louis,1904,Archery,Archery,"HOWELL, Matilda Scott",USA,Women,double national round (60y - 50y),W,Gold

 <h3>String handling</h3> Generally have names matching the equivalent scaler built in string methods that are available in Python. These are available under the str attribute. Using the str attribute, you have access to several common string methods, such as contains, startswith, isnumeric and so on. [Series.str.contains(),Series.str.startswith(),Series.str.isnumeric()]

In [24]:
df.Athlete.str.contains('Florence').head()

0    False
1    False
2    False
3    False
4    False
Name: Athlete, dtype: bool

In [83]:
df[df.Athlete.str.contains('Florence')]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
1843,London,1908,Skating,Figure skating,"SYERS, Florence",GBR,Women,individual,W,Gold
1848,London,1908,Skating,Figure skating,"SYERS, Florence",GBR,Women,pairs,X,Bronze
4173,Paris,1924,Aquatics,Swimming,"BARKER, Florence",GBR,Women,4x100m freestyle relay,W,Silver
8162,Helsinki,1952,Athletics,Athletics,"FOULDS-PAUL, June Florence",GBR,Women,4x100m relay,W,Bronze
9060,Melbourne / Stockholm,1956,Athletics,Athletics,"FOULDS-PAUL, June Florence",GBR,Women,4x100m relay,W,Silver
10849,Tokyo,1964,Athletics,Athletics,"AMOORE-POLLOCK, Judith Florence",AUS,Women,400m,W,Bronze
16817,Los Angeles,1984,Athletics,Athletics,"GRIFFITH-JOYNER, Florence",USA,Women,200m,W,Silver
18287,Seoul,1988,Athletics,Athletics,"GRIFFITH-JOYNER, Florence",USA,Women,100m,W,Gold
18305,Seoul,1988,Athletics,Athletics,"GRIFFITH-JOYNER, Florence",USA,Women,200m,W,Gold
18347,Seoul,1988,Athletics,Athletics,"GRIFFITH-JOYNER, Florence",USA,Women,4x100m relay,W,Gold
18374,Seoul,1988,Athletics,Athletics,"GRIFFITH-JOYNER, Florence",USA,Women,4x400m relay,W,Silver

In [89]:
df[df.Athlete.str.contains('Jesse')]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
1773,London,1908,Shooting,Shooting,"WALLINGFORD, Jesse Alfred",GBR,Men,"50y army pistol, team",M,Bronze
1522,London,1908,Hockey,Hockey,"WOOD, Harvey Jesse",GBR,Men,hockey,M,Gold
6427,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,100m,M,Gold
6439,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,200m,M,Gold
6456,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,4x100m relay,M,Gold
6523,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,long jump,M,Gold
7444,London,1948,Basketball,Basketball,"RENICK, John (Jesse) Bernard",USA,Men,basketball,M,Gold
9070,Melbourne / Stockholm,1956,Athletics,Athletics,"MASHBURN, Jesse William",USA,Men,4x400m relay,M,Gold
11462,Tokyo,1964,Rowing,Rowing,"JAMES, John Jesse",GBR,Men,four without coxswain (4-),M,Silver
13113,Munich,1972,Boxing,Boxing,"VALDEZ, John (Jesse)",USA,Men,63.5 - 67kg (welterweight),M,Bronze
26519,Athens,2004,Hockey,Hockey,"MAHIEU, Jesse",NED,Men,hockey,M,Silver
28065,Beijing,2008,Cycling,Cycling Track,"SERGENT, Jesse",NZL,Men,Team Pursuit (4000m),M,Bronze
27479,Beijing,2008,Aquatics,Water polo,"SMITH, Jesse",USA,Men,water polo,M,Silver

In [134]:
jo=df[df.Athlete=='OWENS, Jesse']
jo

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
6427,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,100m,M,Gold
6439,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,200m,M,Gold
6456,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,4x100m relay,M,Gold
6523,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,long jump,M,Gold

In [135]:
jo.Event.value_counts()

100m            1
4x100m relay    1
200m            1
long jump       1
Name: Event, dtype: int64

In [132]:
ch=df[(df.Sport=="Badminton")&(df.Gender=="Men")&(df.Event=="singles")&(df.Medal=="Gold")]
ch

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
20045,Barcelona,1992,Badminton,Badminton,"BUDI KUSUMA, Alan",INA,Men,singles,M,Gold
21787,Atlanta,1996,Badminton,Badminton,"HOYER-LARSEN, Poul Erik",DEN,Men,singles,M,Gold
23717,Sydney,2000,Badminton,Badminton,"JI, Xinpeng",CHN,Men,singles,M,Gold
25734,Athens,2004,Badminton,Badminton,"HIDAYAT, Taufik",INA,Men,singles,M,Gold
27741,Beijing,2008,Badminton,Badminton,"LIN, Dan",CHN,Men,singles,M,Gold

In [136]:
ch.sort_values(by="Athlete")

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
20045,Barcelona,1992,Badminton,Badminton,"BUDI KUSUMA, Alan",INA,Men,singles,M,Gold
25734,Athens,2004,Badminton,Badminton,"HIDAYAT, Taufik",INA,Men,singles,M,Gold
21787,Atlanta,1996,Badminton,Badminton,"HOYER-LARSEN, Poul Erik",DEN,Men,singles,M,Gold
23717,Sydney,2000,Badminton,Badminton,"JI, Xinpeng",CHN,Men,singles,M,Gold
27741,Beijing,2008,Badminton,Badminton,"LIN, Dan",CHN,Men,singles,M,Gold

In [27]:
co=df[( df.Edition >=1984)]
co.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
16592,Los Angeles,1984,Aquatics,Diving,"LI, Kong-Zheng",CHN,Men,10m platform,M,Bronze
16593,Los Angeles,1984,Aquatics,Diving,"LOUGANIS, Gregory",USA,Men,10m platform,M,Gold
16594,Los Angeles,1984,Aquatics,Diving,"KIMBALL, Bruce D.",USA,Men,10m platform,M,Silver
16595,Los Angeles,1984,Aquatics,Diving,"WYLAND-WILLIAMS, Wendy Lian",USA,Women,10m platform,W,Bronze
16596,Los Angeles,1984,Aquatics,Diving,"ZHOU, Ji-Hong",CHN,Women,10m platform,W,Gold

In [153]:
co.NOC.value_counts().head(3)

USA    1837
AUS     762
GER     691
Name: NOC, dtype: int64

In [28]:
f=df[(df.Gender=="Men")&(df.Medal=="Gold")&(df.Event=="100m")].sort_values(by="Edition",ascending=False)[["City","Edition","Athlete","NOC"]]
f.head()

            City  Edition            Athlete  NOC
27552    Beijing     2008        BOLT, Usain  JAM
25539     Athens     2004     GATLIN, Justin  USA
23521     Sydney     2000    GREENE, Maurice  USA
21598    Atlanta     1996    BAILEY, Donovan  CAN
19859  Barcelona     1992  CHRISTIE, Linford  GBR